QinYuan0618/stm32l431_pn5180/Core/pn5180/demo/NfcrdlibEx1_DiscoveryLoop/NfcrdlibEx1_DiscoveryLoop.c
        status = phacDiscLoop_SetConfig(pDiscLoop, PHAC_DISCLOOP_CONFIG_GTB_VALUE_US, 5100);
        CHECK_STATUS(status);

        /* Configure AFI for the type B tags */
        status = phacDiscLoop_SetConfig(pDiscLoop, PHAC_DISCLOOP_CONFIG_TYPEB_AFI_REQ, 0x00);
        CHECK_STATUS(status);

        /* Configure FSDI for the type B tags */
        status = phacDiscLoop_SetConfig(pDiscLoop, PHAC_DISCLOOP_CONFIG_TYPEB_FSDI, 0x08);
        CHECK_STATUS(status);

        /* Configure CID for the type B tags */
        status = phacDiscLoop_SetConfig(pDiscLoop, PHAC_DISCLOOP_CONFIG_TYPEB_CID, 0x00);
        CHECK_STATUS(status);

        /* Configure DRI for the type B tags */
        status = phacDiscLoop_SetConfig(pDiscLoop, PHAC_DISCLOOP_CONFIG_TYPEB_DRI, 0x00);
        CHECK_STATUS(status);

        /* Configure DSI for the type B tags */
        status = phacDiscLoop_SetConfig(pDiscLoop, PHAC_DISCLOOP_CONFIG_TYPEB_DSI, 0x00);
        CHECK_STATUS(status);

        /* Configure Extended ATQB support for the type B tags */
        status = phacDiscLoop_SetConfig(pDiscLoop, PHAC_DISCLOOP_CONFIG_TYPEB_EXTATQB, 0x00);
        CHECK_STATUS(status);
#endif
        /* Configure reader library mode */
        status = phacDiscLoop_SetConfig(pDiscLoop, PHAC_DISCLOOP_CONFIG_OPE_MODE, RD_LIB_MODE_EMVCO);
        CHECK_STATUS(status);
    }
    else
    {
        /* Do Nothing */
    }
    return status;
}
#endif /* ENABLE_DISC_CONFIG */


/* 测试射频场 */
void TestRFField(void)
{
    phStatus_t status;
    uint32_t regValue;

    printf("\n=== RF FIELD TEST ===\n");

    // 2. 检查RF状态
    status = phhalHw_Pn5180_Instr_ReadRegister(pHal, RF_STATUS, &regValue);
    printf("RF_STATUS: 0x%08lX (status: 0x%04X)\n", regValue, status);

    // 3. 强制开启RF场
    printf("Turning RF Field ON...\n");
    status = phhalHw_FieldOn(pHal);
    printf("FieldOn status: 0x%04X\n", status);

    HAL_Delay(100);  // 等待RF场稳定

    // 4. 再次检查RF状态
    status = phhalHw_Pn5180_Instr_ReadRegister(pHal, RF_STATUS, &regValue);
    printf("RF_STATUS after FieldOn: 0x%08lX\n", regValue);

    // 5. 检查IRQ状态
    status = phhalHw_Pn5180_Instr_ReadRegister(pHal, IRQ_STATUS, &regValue);
    printf("IRQ_STATUS: 0x%08lX\n", regValue);

    printf("=== RF FIELD TEST COMPLETE ===\n\n");
}
